Tekla Open API Reference for Tekla Structures 2025
AutoSizeOptions Enumeration
 Options for controlling how the sheet size is calculated when the SizeDefinitionMode is AutoSize.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AutoSizeOptions
Public Enumeration AutoSizeOptions
Members
Member name | Value | Description
CalculatedSizes | 0 | Use "calculated size" values of the selected layout in the drawing.
FixedSizes | 1 | Use "fixed size" values of the selected layout in the drawing.
CalculatedAndFixedSizes | 2 | Use both "fixed size" and "calculated size" values of the selected layout in the drawing.
See Also
Reference
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.SizeDefinitionMode
Tekla.Structures.Drawing.LayoutAttributes